app/controllers/restaurant_pizzas_controller.rb

    def get_restaurants
        render json: Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def get_pizzas
        render json: Pizza.all
---
SELECT "pizzas".* FROM "pizzas"

    def get_restaurants_id
        @restaurant = Restaurant.includes(:pizzas).find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def delete
        @restaurant = Restaurant.find_by(id: params[:id])
        if @restaurant
            @restaurant.restaurant_pizzas.destroy_all
            @restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]